---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveTopDir2Generic
source: html/25b8e256-3226-619b-2b5b-96642ad38908.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarSystemActiveTopDir2Generic Property

"Top/Exterior Minor Direction"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarSystemActiveTopDir2Generic { get; }
```